import 'package:muslim/src/data/models/thiker_model.dart';

List<ThikerModel> morning = [
  ThikerModel(
    thiker:
        'اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلاَّ بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ',
    repeat: 1,
  ),
  ThikerModel(
    thiker:
        'قُلْ هُوَ اللّٰهُ اَحَدٌ(1) اَللّٰهُ الصَّمَدُ(2) لَمْ یَلِدْ وَ لَمْ یُوْلَدْ(3) وَ لَمْ یَكُنْ لَّهٗ كُفُوًا اَحَدٌ(4)',
    repeat: 3,
  ),
  ThikerModel(
    thiker:
        'قُلْ اَعُوْذُ بِرَبِّ الْفَلَقِ(1) مِنْ شَرِّ مَا خَلَقَ(2) وَ مِنْ شَرِّ غَاسِقٍ اِذَا وَقَبَ(3) وَ مِنْ شَرِّ النَّفّٰثٰتِ فِی الْعُقَدِ(4) وَ مِنْ شَرِّ حَاسِدٍ اِذَا حَسَدَ(5)',
    repeat: 3,
  ),
  ThikerModel(
    thiker:
        'قُلْ اَعُوْذُ بِرَبِّ النَّاسِ(1) مَلِكِ النَّاسِ(2) اِلٰهِ النَّاسِ(3) مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ(4) الَّذِیْ یُوَسْوِسُ فِیْ صُدُوْرِ النَّاسِ(5) مِنَ الْجِنَّةِ وَ النَّاسِ(6)',
    repeat: 3,
  ),
];
List<ThikerModel> evening = [
  ThikerModel(
    thiker:
        'اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلاَّ بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ',
    repeat: 1,
  ),
  ThikerModel(
    thiker:
        'قُلْ هُوَ اللّٰهُ اَحَدٌ(1) اَللّٰهُ الصَّمَدُ(2) لَمْ یَلِدْ وَ لَمْ یُوْلَدْ(3) وَ لَمْ یَكُنْ لَّهٗ كُفُوًا اَحَدٌ(4)',
    repeat: 3,
  ),
];
